var q = [
{
        "code": "FEGMRKLD",
        "mail": "cyu2197@gmail.com",
        "addr": "高雄市岡山區竹圍里竹圍路258號",
        "phone": "0932754104"
},
    {
        "q": "在2000年時由蘋果公司推出的音樂播放器，在三年內共銷售了超過一千萬部。其名為？",
        "a1": "iPod",
        "a2": "iPad",
        "a3": "iPhone",
        "a4": "iMac",
        "undefined": 40
    },
    {
        "q": "在2007年時由蘋果公司推出的智慧型手機，該系列手機革命性地重新塑造電話的定義，其名為？",
        "a1": "iPhone",
        "a2": "iPad",
        "a3": "iPod",
        "a4": "iMac",
        "undefined": 44
    },
    {
        "q": "2011年10月，iPhone4S發布會上蘋果宣布將成為iOS一部份的智慧語音助理名為？",
        "a1": "Siri",
        "a2": "Wifi",
        "a3": "Wiki",
        "a4": "Mini",
        "undefined": 44
    },
    {
        "q": "1996年，首個在標準比賽時限內擊敗西洋棋世界冠軍的電腦系統名為？",
        "a1": "深藍",
        "a2": "深紅",
        "a3": "深雪",
        "a4": "深思",
        "undefined": 33
    },
    {
        "q": "2016年3月，在圍棋比賽中4:1擊敗頂尖職業棋士李世乭的電腦系統名為？",
        "a1": "Alphago",
        "a2": "DeltaGo",
        "a3": "PokemonGo",
        "a4": "BetaGo",
        "undefined": 36
    },
    {
        "q": "在2010年推出服務的Uber（優步）公司，提供哪一類型的服務？",
        "a1": "即時共乘",
        "a2": "外賣外送",
        "a3": "住家清潔",
        "a4": "長期照護",
        "undefined": 32
    },
    {
        "q": "Uber（優步）公司在2010年推出服務，造成許多爭議，請問Uber在哪個地區是合法的？",
        "a1": "美國加州",
        "a2": "法國",
        "a3": "西班牙",
        "a4": "葡萄牙",
        "undefined": 44
    },
    {
        "q": "2017年3月15日，提供載客車租賃以及即時共乘的台灣優步公司遭查封，請問原因是？",
        "a1": "欠繳五千萬營業稅",
        "a2": "車子發生車禍",
        "a3": "共乘人數不足",
        "a4": "不遵守交通規則",
        "undefined": 41
    },
    {
        "q": "共享經濟新創的一員Airbnb於2008年成立，請問Airbnb提供什麼共享的服務？",
        "a1": "住宿",
        "a2": "食物",
        "a3": "交通",
        "a4": "歡笑",
        "undefined": 42
    },
    {
        "q": "2017年3月，提供住宿分享的網站Airbnb為了進軍中國市場，宣布它的中文名字是？",
        "a1": "爱彼迎",
        "a2": "艾比郎",
        "a3": "愛比較",
        "a4": "愛的路上我和你",
        "undefined": 42
    },
    {
        "q": "隨處可停的共享單車oBike，2017年4月開始在台營運後，引發諸多爭議，主要原因是？",
        "a1": "佔用公用停車格",
        "a2": "\b太受歡迎",
        "a3": "坐墊被拆",
        "a4": "找不到車子",
        "undefined": 43
    },
    {
        "q": "隨處可停的共享單車oBike，2017年4月開始在台營運，請問obike借還車的方式是？",
        "a1": "手機應用程式",
        "a2": "現場服務台登記",
        "a3": "悠遊卡",
        "a4": "郵寄鑰匙",
        "undefined": 44
    },
    {
        "q": "美國最大的電動汽車公司特斯拉，在2008年推出其第一款電動跑車，其名為？",
        "a1": "Tesla Roadster",
        "a2": "阿斯拉",
        "a3": "伙計",
        "a4": "AE86",
        "undefined": 36
    },
    {
        "q": "2013年因戰火被列入世界遺產的古城阿勒頗位於哪一個國家？",
        "a1": "敘利亞",
        "a2": "巴勒斯坦",
        "a3": "土耳其",
        "a4": "伊拉克",
        "undefined": 29
    },
    {
        "q": "2013年因戰火被列入世界遺產的大馬士革古城位於哪一個國家？",
        "a1": "敘利亞",
        "a2": "以色列",
        "a3": "葉門",
        "a4": "阿富汗",
        "undefined": 30
    },
    {
        "q": "2003年被列入世界遺產的亞述古城，是古代亞述帝國的首都，位於兩河流域的哪一個國家？",
        "a1": "伊拉克",
        "a2": "愛沙尼亞",
        "a3": "拉脫維亞",
        "a4": "立陶宛",
        "undefined": 42
    },
    {
        "q": "1981年被列入世界遺產的大堡礁，位於下列哪一個國家？",
        "a1": "澳大利亞",
        "a2": "紐西蘭",
        "a3": "巴布亞紐幾內亞",
        "a4": "馬達加斯加",
        "undefined": 27
    },
    {
        "q": "1981年被列入世界遺產的大堡礁，未受到下列哪一下環境威脅？",
        "a1": "愛護環境的觀光客",
        "a2": "全球暖化",
        "a3": "水質污染",
        "a4": "過度捕撈影響生態",
        "undefined": 30
    },
    {
        "q": "澳洲的烏盧魯－卡達族塔國家公園在1981年被列入世界自然遺產，其最有名的艾爾斯岩被認為是？",
        "a1": "世界最大獨塊岩體",
        "a2": "賢者之石",
        "a3": "隕石",
        "a4": "世界之石",
        "undefined": 45
    },
    {
        "q": "雪梨大劇院於西元1973年正式落成，請問其位於哪個國家？",
        "a1": "澳洲",
        "a2": "紐西蘭",
        "a3": "加拿大",
        "a4": "法國",
        "undefined": 28
    },
    {
        "q": "1992年，柬埔寨吳哥古跡被列入世界文化遺產，請問吳哥窟當初被建造用來作為？",
        "a1": "國王的太廟和陵寢",
        "a2": "佛教的寺廟",
        "a3": "基督教的教堂",
        "a4": "印度教神的廟宇",
        "undefined": 38
    },
    {
        "q": "1992年11月15日，藝人柯受良在北京金山嶺騎摩托車飛越過什麼？",
        "a1": "長城",
        "a2": "天安門廣場",
        "a3": "頤和園",
        "a4": "圓明園",
        "undefined": 33
    },
    {
        "q": "1997年6月1日，藝人柯受良駕駛跑車飛越過什麼，獲得「亞洲第一飛人」的稱號？",
        "a1": "黃河壺口瀑布",
        "a2": "尼加拉瀑布",
        "a3": "三疊泉瀑布",
        "a4": "萊茵瀑布",
        "undefined": 39
    },
    {
        "q": "位於中國四川省，以絕麗風景聞名，於1992年被列入世界文化遺產，請問這是什麼風景區？",
        "a1": "九寨溝",
        "a2": "香格里拉",
        "a3": "排水溝",
        "a4": "黑水溝",
        "undefined": 42
    },
    {
        "q": "以絕麗風景聞名的九寨溝，於2017年8月於風景區內發生發生什麼事，導致多處崩塌，暫時封閉？",
        "a1": "地震",
        "a2": "核爆",
        "a3": "海嘯",
        "a4": "暴風雪",
        "undefined": 45
    },
    {
        "q": "蒙兀兒王朝皇帝沙迦罕為了紀念他的妻子建造的陵墓，在1983年被列為世界遺產，此建築名為？",
        "a1": "泰姬瑪哈陵",
        "a2": "金字塔",
        "a3": "愛妻之墓",
        "a4": "\u001d大家都敢去的墓",
        "undefined": 44
    },
    {
        "q": "位於日本兵庫縣姬路市的城堡，也被稱為白鷺城，1993年成為日本第一個登錄的世界遺產，名為？",
        "a1": "姬路城",
        "a2": "熊本城",
        "a3": "松本城",
        "a4": "淡路城",
        "undefined": 45
    },
    {
        "q": "位於越南的海灣，密集地分布著近兩千座石灰岩島嶼，1994年被列為世界遺產，請問是哪座海灣？",
        "a1": "下龍灣",
        "a2": "九龍灣",
        "a3": "上龍灣",
        "a4": "中龍灣",
        "undefined": 45
    },
    {
        "q": "於2012年12月上映的電影「悲慘世界」，其原著小說的作者是誰？",
        "a1": "維克多·雨果",
        "a2": "J·R·R·托爾金",
        "a3": "喬治·R·R·馬丁",
        "a4": "C·S·路易斯",
        "undefined": 32
    },
    {
        "q": "於2012年12月上映的電影「悲慘世界」，其背景故事是下列哪一段歷史？",
        "a1": "法國大革命",
        "a2": "南北戰爭",
        "a3": "玫瑰戰爭",
        "a4": "辛亥革命",
        "undefined": 35
    },
    {
        "q": "1981年，歌舞劇『貓』在倫敦首演，請問這部劇是在描述一群什麼的故事？",
        "a1": "貓",
        "a2": "狗",
        "a3": "鼠",
        "a4": "人",
        "undefined": 35
    },
    {
        "q": "2013年李榮浩的「模特」專輯中有一首以中國古代詩人為名的歌，請問歌名是？",
        "a1": "李白",
        "a2": "杜甫",
        "a3": "孟浩然",
        "a4": "白居易",
        "undefined": 37
    },
    {
        "q": "2015年上映的的電影『神鬼獵人』男主角，也是他首次獲得奧斯卡最佳男主角的演員是誰？",
        "a1": "李奧納多·狄卡皮歐",
        "a2": "李奧納多·皮卡丘",
        "a3": "李奧納多·皮卡忠",
        "a4": "李奧納多·酷拉皮卡",
        "undefined": 42
    },
    {
        "q": "2015年上映的的電影『神鬼獵人』中，男主角為了保暖，躲在什麼動物的肚子裡？",
        "a1": "馬",
        "a2": "龍貓公車",
        "a3": "鯨魚",
        "a4": "克蘇恩",
        "undefined": 38
    },
    {
        "q": "1988年上映的電影『情陷布拉格』是改編自米蘭·昆德拉的哪一部小說？",
        "a1": "生命不能承受之輕",
        "a2": "飄",
        "a3": "百年孤寂",
        "a4": "簡愛",
        "undefined": 34
    },
    {
        "q": "1994年上映的哪一部電影，是改編自史蒂芬·金的短篇『麗塔海華絲與蕭山克監獄的救贖』？",
        "a1": "刺激1995",
        "a2": "阿甘正傳",
        "a3": "黑色追緝令",
        "a4": "捍衛戰警",
        "undefined": 43
    },
    {
        "q": "1999年上映的美國電影『鬥陣俱樂部』是改編自哪一部1996年的同名小說？",
        "a1": "鬥陣俱樂部",
        "a2": "門陣俱樂陪",
        "a3": "關陣俱樂部",
        "a4": "開陣俱樂部",
        "undefined": 37
    },
    {
        "q": "1982年上映的哪一部科幻電影，是改編自小說『仿生人會夢見電子羊嗎？』？",
        "a1": "銀翼殺手",
        "a2": "絕命終結站",
        "a3": "心靈捕手",
        "a4": "X戰警",
        "undefined": 36
    },
    {
        "q": "2008年上映的電影『畫皮』是改編自哪一部中國古典神怪小說？",
        "a1": "聊齋誌異",
        "a2": "三國演義",
        "a3": "官場現形記",
        "a4": "本草綱目",
        "undefined": 30
    },
    {
        "q": "2014年上映的美國科幻動作電影『明日邊界』，是改編自哪一部2004年出版的輕小說？",
        "a1": "殺戮輪迴",
        "a2": "狼與辛香料",
        "a3": "零之使魔",
        "a4": "刀劍神域",
        "undefined": 42
    },
    {
        "q": "2000年7月出版的哈利波特第四集火盃的考驗中提到三種不赦咒，請問下列哪一種不是？",
        "a1": "路摸思",
        "a2": "噩噩令",
        "a3": "咒咒虐",
        "a4": "啊哇呾喀呾啦",
        "undefined": 41
    },
    {
        "q": "被評為：「在偉大的美國音樂傳統上創造出新的詩意表達形式」的2016諾貝爾文學獎得主是？",
        "a1": "巴布·狄倫",
        "a2": "喬治·哈里遜",
        "a3": "約翰·藍儂",
        "a4": "保羅·麥卡尼",
        "undefined": 43
    },
    {
        "q": "2000年獲得諾北爾文學獎的法籍華裔作家高行健，他的得獎作品是？",
        "a1": "靈山",
        "a2": "零山",
        "a3": "冷山",
        "a4": "樂山",
        "undefined": 32
    },
    {
        "q": "獲得2014年美國國家圖書獎卓越貢獻獎的作家娥蘇拉·勒瑰恩，請問她最主要的作品是？",
        "a1": "地海系列",
        "a2": "魔戒系列",
        "a3": "哈利波特系列",
        "a4": "納尼亞系列",
        "undefined": 41
    },
    {
        "q": "史蒂芬·金於2003年獲得美國國家圖書獎卓越貢獻獎，請問他的小說以什麼風格聞名？",
        "a1": "恐怖驚悚",
        "a2": "幸福洋溢",
        "a3": "\b搞笑幽默",
        "a4": "親情愛情",
        "undefined": 40
    },
    {
        "q": "台灣選手E.T為EVO 2017格鬥遊戲大賽KOF項目的世界冠軍，請問他比的是哪一款遊戲？",
        "a1": "KOF14",
        "a2": "鐵拳",
        "a3": "快打旋風",
        "a4": "真人快打",
        "undefined": 45
    },
    {
        "q": "台灣選手小向為EVO 2015格鬥遊戲大賽單項亞軍，請問他比的是哪一款遊戲？",
        "a1": "快打旋風",
        "a2": "格鬥天王",
        "a3": "鐵拳",
        "a4": "真人快打",
        "undefined": 38
    },
    {
        "q": "台灣的哪一個英雄聯盟戰隊，在2017年的國際賽事IEM獲得冠軍？",
        "a1": "閃電狼",
        "a2": "橘子熊",
        "a3": "AHQ",
        "a4": "JTeam",
        "undefined": 32
    },
    {
        "q": "台灣英雄聯盟戰隊TPA，在2012連打敗了哪一個國家的戰隊得到S2賽季總冠軍？",
        "a1": "韓國",
        "a2": "中國",
        "a3": "美國",
        "a4": "歐洲",
        "undefined": 39
    },
    {
        "q": "2017年，僅7歲的台灣人張瑜庭在某項世界錦標賽中，拿下4項世界冠軍，請問他參加的項目是？",
        "a1": "疊杯",
        "a2": "籃球",
        "a3": "舉重",
        "a4": "美式足球",
        "undefined": 45
    },
    {
        "q": "從2012年因新聞報導法拉利跑車被刮花開始，以沙啞奇特的嗓音和高調炫富的行徑爆紅，是誰？",
        "a1": "法拉利姊",
        "a2": "賓士姊",
        "a3": "藍寶堅尼姊",
        "a4": "保時捷姊",
        "undefined": 44
    },
    {
        "q": "2015年因一句「颱風天就是要OO」而爆紅的泛舟哥，請問OO指的是什麼？",
        "a1": "泛舟",
        "a2": "洗碗",
        "a3": "\b爬山",
        "a4": "放風箏",
        "undefined": 36
    },
    {
        "q": "2011年參加綜藝節目《大學生了沒》中扮醜搞怪而爆紅的Hold住姊，請問他的招牌表演是？",
        "a1": "一秒變格格",
        "a2": "轉三圈學狗叫",
        "a3": "空中轉體720度",
        "a4": "快速疊杯",
        "undefined": 44
    },
    {
        "q": "於2015年5月過世的豬哥亮，其生涯早期的成名作品是？",
        "a1": "豬哥亮歌廳秀",
        "a2": "五燈獎",
        "a3": "百戰百勝",
        "a4": "龍兄虎弟",
        "undefined": 27
    },
    {
        "q": "2010年以《豬哥會社》獲得金鐘綜藝節目主持人講的主持人是誰？",
        "a1": "豬哥亮、侯怡君",
        "a2": "陶晶瑩",
        "a3": "張菲",
        "a4": "庾澄慶",
        "undefined": 31
    },
    {
        "q": "1997年，「異塵餘生」系列作的第一部作品發售，請問此系列作品的背景通常設定於什麼事件後？",
        "a1": "核戰",
        "a2": "異世界入侵",
        "a3": "時空跳躍",
        "a4": "瘟疫流行",
        "undefined": 45
    },
    {
        "q": "1997年，「異塵餘生」系列作的第一部作品發售，請問此系列作品的遊戲方式通常是？",
        "a1": "射擊遊戲",
        "a2": "角色扮演",
        "a3": "手遊課金",
        "a4": "戀愛養成",
        "undefined": 40
    },
    {
        "q": "經典沙盒RPG上古卷軸在1994推出第一作「上古卷軸：競技場」，請問遊戲故事發生的地點在？",
        "a1": "泰姆瑞爾大陸",
        "a2": "費倫大陸",
        "a3": "艾澤拉斯大陸",
        "a4": "泰瑞亞大陸",
        "undefined": 45
    },
    {
        "q": "RPG上古卷軸在2011年推出第五代「Skyrim」，故事一開始主角在被行刑前出現了什麼？",
        "a1": "龍",
        "a2": "來自未來的機器貓",
        "a3": "鐵甲蛹",
        "a4": "超大型巨人",
        "undefined": 45
    },
    {
        "q": "開放式RPG上古卷軸在2011年推出第五代「Skyrim」，請問在遊戲中沒辦法做什麼？",
        "a1": "叫外賣來當晚餐",
        "a2": "用弓箭射下飛鳥",
        "a3": "用木桶套店主的頭",
        "a4": "騎乘飛龍",
        "undefined": 43
    },
    {
        "q": "暗黑破壞神3在2017年6月的「暗黑破壞神 3：奪魂之鐮」改版推出了哪一個新職業？",
        "a1": "聖教軍",
        "a2": "鐵狼衛兵",
        "a3": "母牛之王",
        "a4": "彩虹小馬",
        "undefined": 41
    },
    {
        "q": "暗黑破壞神3在2017年6月的「死靈法師的崛起」改版推出了哪一個新職業？",
        "a1": "死靈法師",
        "a2": "陰陽師",
        "a3": "吟遊詩人",
        "a4": "蘿格斥候",
        "undefined": 36
    },
    {
        "q": "因為出版社的關係，原本名為海賊王的漫畫，在2003年改名為下列何者？",
        "a1": "航海王",
        "a2": "海霸王",
        "a3": "山賊王",
        "a4": "遊戲王",
        "undefined": 34
    },
    {
        "q": "魔法風雲會遊戲第一個系列出版於1993年，請問該遊戲屬於哪種類型？",
        "a1": "卡牌遊戲",
        "a2": "電子遊戲",
        "a3": "團康遊戲",
        "a4": "賭博遊戲",
        "undefined": 33
    },
    {
        "q": "卡牌遊戲魔法風雲會出版於1993年，請問該遊戲沒有下列何種顏色的卡牌？",
        "a1": "黃色",
        "a2": "藍色",
        "a3": "紅色",
        "a4": "綠色",
        "undefined": 35
    },
    {
        "q": "卡牌遊戲魔法風雲會出版於1993年，請問何者不是遊戲中白色的卡牌所代表的概念？",
        "a1": "混亂",
        "a2": "法制",
        "a3": "秩序",
        "a4": "公平",
        "undefined": 39
    },
    {
        "q": "卡牌遊戲魔法風雲會出版於1993年，請問何者不是遊戲中藍色的卡牌所代表的概念？",
        "a1": "野蠻",
        "a2": "知識",
        "a3": "計謀",
        "a4": "幻覺",
        "undefined": 39
    },
    {
        "q": "卡牌遊戲魔法風雲會出版於1993年，請問何者不是遊戲中黑色的卡牌所代表的概念？",
        "a1": "純潔",
        "a2": "死亡",
        "a3": "疾病",
        "a4": "野心",
        "undefined": 39
    },
    {
        "q": "卡牌遊戲魔法風雲會出版於1993年，請問何者不是遊戲中紅色的卡牌所代表的概念？",
        "a1": "平靜",
        "a2": "衝動",
        "a3": "破壞",
        "a4": "憤怒",
        "undefined": 39
    },
    {
        "q": "卡牌遊戲魔法風雲會出版於1993年，請問何者不是遊戲中綠色的卡牌所代表的概念？",
        "a1": "人造",
        "a2": "成長",
        "a3": "生命",
        "a4": "自然",
        "undefined": 39
    },
    {
        "q": "卡牌遊戲魔法風雲會出版於1993年，請問遊戲中無色卡牌通常代表什麼？",
        "a1": "神器(人造物)",
        "a2": "動物",
        "a3": "植物",
        "a4": "法術",
        "undefined": 34
    },
    {
        "q": "卡牌遊戲魔法風雲會出版於1993年，請問魔法風雲會的資源卡又稱為？",
        "a1": "地牌",
        "a2": "水晶",
        "a3": "金牌",
        "a4": "鬼牌",
        "undefined": 33
    },
    {
        "q": "卡牌遊戲魔法風雲會出版於1993年，請問魔法風雲會背景設定中，擁有穿梭世界能力的人稱為？",
        "a1": "鵬洛客(Planeswalker)",
        "a2": "亞倫沃克",
        "a3": "強尼沃克",
        "a4": "V怪客",
        "undefined": 44
    },
    {
        "q": "2004年6月24日『英雄傳說VI 空之軌跡』在日本發售，請問軌跡系列是什麼類型的遊戲？",
        "a1": "角色扮演",
        "a2": "模擬建造",
        "a3": "第一人稱射擊",
        "a4": "即時戰略",
        "undefined": 44
    },
    {
        "q": "2004年6月24日『英雄傳說VI 空之軌跡』發售，請問遊戲中主角艾絲蒂爾所使用的武器是？",
        "a1": "棍",
        "a2": "爪",
        "a3": "鞭",
        "a4": "斧",
        "undefined": 45
    },
    {
        "q": "2004年6月24日『英雄傳說VI 空之軌跡』發售，在遊戲中，七耀石所蘊含的神秘能量稱為？",
        "a1": "導力",
        "a2": "念",
        "a3": "查克拉",
        "a4": "靈氣",
        "undefined": 45
    },
    {
        "q": "1996年在日本發售精靈寶可夢的紅、綠、藍版，請問當時可收集的寶可夢共有幾種？",
        "a1": 151,
        "a2": 100,
        "a3": 200,
        "a4": 300,
        "undefined": 39
    },
    {
        "q": "1999年發售的精靈寶可夢金、銀版為第二世代，請問當時全國圖鑑共累積有多少種寶可夢？",
        "a1": 251,
        "a2": 100,
        "a3": 200,
        "a4": 300,
        "undefined": 42
    },
    {
        "q": "2002年發售的精靈寶可夢紅、藍、綠寶石為第三世代，請問當時全國圖鑑共累積有多少種寶可夢？",
        "a1": 386,
        "a2": 286,
        "a3": 486,
        "a4": 586,
        "undefined": 45
    },
    {
        "q": "2006年發售的精靈寶可夢珍珠、鑽石為第四世代，請問當時全國圖鑑共累積有多少種寶可夢？",
        "a1": 493,
        "a2": 128,
        "a3": 256,
        "a4": 64,
        "undefined": 43
    },
    {
        "q": "2010年發售的精靈寶可夢黑、白版為第五世代，請問當時全國圖鑑共累積有多少種寶可夢？",
        "a1": 649,
        "a2": 100,
        "a3": 200,
        "a4": 300,
        "undefined": 42
    },
    {
        "q": "2013年發售的精靈寶可夢X、Y版為第六世代，請問當時全國圖鑑共累積有多少種寶可夢？",
        "a1": 721,
        "a2": 100,
        "a3": 200,
        "a4": 300,
        "undefined": 42
    },
    {
        "q": "2016年發售的精靈寶可夢太陽、月亮為第七世代，請問當時全國圖鑑共累積有多少種寶可夢？",
        "a1": 802,
        "a2": 200,
        "a3": 400,
        "a4": 600,
        "undefined": 43
    },
    {
        "q": "2016年發售的精靈寶可夢太陽、月亮遊戲中，下列那一種道具不能回復寶可夢的血量？",
        "a1": "解毒藥",
        "a2": "傷藥",
        "a3": "好傷藥",
        "a4": "厲害傷藥",
        "undefined": 40
    },
    {
        "q": "2016年發售的精靈寶可夢太陽、月亮遊戲中，下列那一種道具可以解除寶可夢身上的異常狀態？",
        "a1": "萬靈藥",
        "a2": "精靈球",
        "a3": "雷之石",
        "a4": "活力碎片",
        "undefined": 44
    },
    {
        "q": "2016年發售的精靈寶可夢太陽、月亮遊戲中，下列那一種道具可以解除寶可夢身上的瀕死狀態？",
        "a1": "活力碎片",
        "a2": "傷藥",
        "a3": "精靈球",
        "a4": "離洞繩",
        "undefined": 44
    },
    {
        "q": "1998年發售的精靈寶可夢黃版，請問遊戲中讓皮卡丘進化需要下列何種道具？",
        "a1": "雷之石",
        "a2": "水之石",
        "a3": "火之石",
        "a4": "不變之石",
        "undefined": 36
    },
    {
        "q": "2013年發售的精靈寶可夢X、Y版本中，新增了下列哪一項新的寶可夢屬性？",
        "a1": "妖精屬性",
        "a2": "水屬性",
        "a3": "火屬性",
        "a4": "雷屬性",
        "undefined": 36
    },
    {
        "q": "2016年發售的精靈寶可夢太陽、月亮遊戲中，下列那一種精靈球必定可以捕捉到寶可夢？",
        "a1": "大師球",
        "a2": "豪華球",
        "a3": "紀念球",
        "a4": "貴重球",
        "undefined": 41
    },
    {
        "q": "2016年發售的精靈寶可夢太陽、月亮遊戲中，下列那一種精靈球更容易捉到逃跑速度快的寶可夢？",
        "a1": "速度球",
        "a2": "甜蜜球",
        "a3": "月亮球",
        "a4": "重複球",
        "undefined": 45
    },
    {
        "q": "2006年9月開始連載的漫畫『噬謊者』，是什麼樣類型的漫畫？",
        "a1": "智謀賭博",
        "a2": "時空穿越",
        "a3": "校園純愛",
        "a4": "魔法冒險",
        "undefined": 30
    },
    {
        "q": "2006年9月開始連載的漫畫『噬謊者』中的天才賭徒 ，通稱「噬謊者」的人名為？",
        "a1": "斑目貘",
        "a2": "夜行妃古壹",
        "a3": "切間創一",
        "a4": "梶隆臣",
        "undefined": 39
    },
    {
        "q": "在2009年1月3日發明創立的比特幣屬於何種貨幣？",
        "a1": "電子貨幣",
        "a2": "金屬貨幣",
        "a3": "紙幣",
        "a4": "自然貨幣",
        "undefined": 25
    },
    {
        "q": "在2009年1月3日發明創立的比特幣主要利用哪一種技術讓交易紀錄無法被竄改？",
        "a1": "區塊鏈",
        "a2": "現金鏈",
        "a3": "物流鏈",
        "a4": "康妮的鎖鏈",
        "undefined": 38
    },
    {
        "q": "約在2014被發明的哪一種貨幣和比特幣一樣都是加密電子貨幣？",
        "a1": "以太幣",
        "a2": "戒尼幣",
        "a3": "貝里幣",
        "a4": "瑪納幣",
        "undefined": 30
    },
    {
        "q": "2009年年底以來出現的歐洲債務危機，有債務問題的不包括下列哪一國？",
        "a1": "德國",
        "a2": "義大利",
        "a3": "西班牙",
        "a4": "希臘",
        "undefined": 34
    },
    {
        "q": "1999年由28個歐洲聯盟成員國中的19個國家組成的貨幣同盟，又稱為？",
        "a1": "歐元區",
        "a2": "地雷區",
        "a3": "手塚區",
        "a4": "紅燈區",
        "undefined": 35
    },
    {
        "q": "2016年6月23日，英國舉行脫歐公投，結果是？",
        "a1": "英國脫離歐盟",
        "a2": "英國不脫離歐盟",
        "a3": "介於脫跟不脫之間",
        "a4": "一年後再公投一次",
        "undefined": 24
    },
    {
        "q": "2016年6月，英國脫離歐盟後，前首相卡麥隆辭職，其後擔任首相的人是？",
        "a1": "德蕾莎·梅伊",
        "a2": "瑪格麗特·柴契爾",
        "a3": "戈登·布朗",
        "a4": "東尼·布萊爾",
        "undefined": 35
    },
    {
        "q": "2005年1月，南韓首都名稱由「漢城」改名為什麼？",
        "a1": "首爾",
        "a2": "釜山",
        "a3": "仁川",
        "a4": "大邱",
        "undefined": 25
    },
    {
        "q": "1986年，美國訂定「馬丁·路德·金恩紀念日」，請問金恩博士最有名的演說名稱為？",
        "a1": "I have a dream",
        "a2": "I have a pen",
        "a3": "I have an apple",
        "a4": "I have pineapple",
        "undefined": 40
    },
    {
        "q": "2016年11月8日贏得大選成為美國總統的人是？",
        "a1": "唐納·川普",
        "a2": "希拉蕊·柯林頓",
        "a3": "巴拉克·歐巴馬",
        "a4": "約翰·馬侃",
        "undefined": 24
    },
    {
        "q": "2017年法國總統選舉中勝出的人是？",
        "a1": "埃瑪紐耶爾·馬克宏",
        "a2": "埃瑪紐耶爾·馬卡龍",
        "a3": "埃瑪紐耶爾·馬克杯",
        "a4": "埃瑪紐耶爾·馬英九",
        "undefined": 18
    },
    {
        "q": "2013年5月愛德華·史諾登向外界披露美國政府的大規模監聽民眾計劃，該計畫名為？",
        "a1": "稜鏡計劃",
        "a2": "火星計劃",
        "a3": "天網計畫",
        "a4": "時代計畫",
        "undefined": 40
    },
    {
        "q": "2013年5月愛德華·史諾登向外界披露美國政府的大規模監聽後，受美國通緝而接受何國的庇護？",
        "a1": "俄國",
        "a2": "台灣",
        "a3": "中國",
        "a4": "北韓",
        "undefined": 45
    },
    {
        "q": "現今的石油大國，也是杜拜的所在地的阿拉伯聯合大公國在1971年脫離下列哪國的殖民而獨立？",
        "a1": "英國",
        "a2": "伊拉克",
        "a3": "伊朗",
        "a4": "葉門",
        "undefined": 44
    },
    {
        "q": "擁有半島電視台的卡達，於1971年脫離下列哪國的殖民而獨立？",
        "a1": "英國",
        "a2": "法國",
        "a3": "德國",
        "a4": "西班牙",
        "undefined": 30
    },
    {
        "q": "2017年6月，哪個國家被指控其鼓勵恐怖主義，周邊9國宣布與其斷交？",
        "a1": "卡達",
        "a2": "越南",
        "a3": "寮國",
        "a4": "柬埔寨",
        "undefined": 34
    },
    {
        "q": "哪一個國家將於2022年舉辦世界杯足球賽，也是阿拉伯世界第一個舉辦世足的國家？",
        "a1": "卡達",
        "a2": "巴西",
        "a3": "阿根廷",
        "a4": "秘魯",
        "undefined": 39
    },
    {
        "q": "2010年12月以來，阿拉伯世界一些國家民眾走上街頭，要求推翻本國的專制政體的行動，稱為？",
        "a1": "阿拉伯之春",
        "a2": "阿拉伯之夏",
        "a3": "阿拉伯之秋",
        "a4": "阿拉伯之冬",
        "undefined": 45
    },
    {
        "q": "哪一個是1975年脫離葡萄牙殖民地身分而獨立，也是網路上爆紅的巫醫治療偏頭痛影片的發源國？",
        "a1": "莫三比克",
        "a2": "日本",
        "a3": "德國",
        "a4": "巴布亞紐幾內亞",
        "undefined": 45
    },
    {
        "q": "某個位於非洲西南部的國家，在1975年脫離葡萄牙殖民地身分而獨立，有非洲的巴西之稱？",
        "a1": "安哥拉",
        "a2": "吉爾吉斯",
        "a3": "塔吉克",
        "a4": "烏茲別克",
        "undefined": 42
    },
    {
        "q": "1976年脫離英國殖民實行自治，並把名字自「英屬索羅門群島」更名的國家現今為什麼名字？",
        "a1": "索羅門群島",
        "a2": "卡加布列島",
        "a3": "羅德島",
        "a4": "水之七島",
        "undefined": 43
    },
    {
        "q": "南非洲重要的文明發源地，在1980年脫離英國殖民地身份而建國，近年嚴重通貨膨脹的國家是？",
        "a1": "辛巴威",
        "a2": "辛巴",
        "a3": "穆法沙",
        "a4": "獅子山",
        "undefined": 44
    },
    {
        "q": "2015年6月，辛巴威政府宣布棄用本國貨幣，改用美金，匯率為多少辛巴威幣兌一美金？",
        "a1": "35千兆",
        "a2": "35萬",
        "a3": "3.5萬",
        "a4": "350萬",
        "undefined": 41
    },
    {
        "q": "1986年，哪一個太平洋島國在美國託管狀態下宣布獨立，也是台灣現有20個邦交國之一？",
        "a1": "馬紹爾群島",
        "a2": "馬達加斯加",
        "a3": "冰島",
        "a4": "海南島",
        "undefined": 42
    },
    {
        "q": "位於東南亞，因開採石油成為世上富有國家之一，在1984年從英國殖民下獲得獨立的是哪個國家？",
        "a1": "汶萊",
        "a2": "越南",
        "a3": "寮國",
        "a4": "菲律賓",
        "undefined": 45
    },
    {
        "q": "哪個是位於西太平洋，由珊瑚礁島構成的島國，在1994年獨立，也是台灣現有20個邦交國之一？",
        "a1": "帛琉",
        "a2": "開曼群島",
        "a3": "冰島",
        "a4": "格陵蘭",
        "undefined": 45
    },
    {
        "q": "1999年12月，澳門的主權由哪一國交還給中國？",
        "a1": "葡萄牙",
        "a2": "西班牙",
        "a3": "英國",
        "a4": "法國",
        "undefined": 24
    },
    {
        "q": "1997年7月1日，香港移交中國，承諾「馬照跑、舞照跳，50年不變」並成立什麼？",
        "a1": "香港特別行政區",
        "a2": "不列塔尼亞第11區",
        "a3": "香港自治區",
        "a4": "天使禁獵區",
        "undefined": 40
    },
    {
        "q": "1985年12月7日與台灣斷交，又於內戰結束後的1990年11月5日復交，位於中美洲？",
        "a1": "尼加拉瓜",
        "a2": "阿拉花瓜",
        "a3": "瓜地馬拉",
        "a4": "喔～喔喔～瓜瓜～",
        "undefined": 43
    },
    {
        "q": "1973年10月23日與台灣斷交，又於1994年復交，是台灣唯二位於非洲的友邦之一？",
        "a1": "布吉納法索",
        "a2": "匈牙利",
        "a3": "奧地利",
        "a4": "克羅埃西亞",
        "undefined": 42
    },
    {
        "q": "台灣在1988年與烏拉圭斷交後，目前在南美洲唯一具有正式邦交的國家為何？",
        "a1": "巴拉圭",
        "a2": "烏拉圭",
        "a3": "綠蠵龜",
        "a4": "傑尼龜",
        "undefined": 36
    },
    {
        "q": "2017年6月，哪一個位於中美洲，擁有運河的國家與台灣斷交？",
        "a1": "巴拿馬",
        "a2": "巴西",
        "a3": "巴哈馬",
        "a4": "巴拉圭",
        "undefined": 30
    },
    {
        "q": "台灣在外交史上首次現任元首出訪梵蒂岡，是在2005年時，哪一位總統出席若望保祿二世的葬禮？",
        "a1": "陳水扁",
        "a2": "馬英九",
        "a3": "李登輝",
        "a4": "蔡英文",
        "undefined": 45
    },
    {
        "q": "1971年時中華民國政府做出什麼決定，使得中華民國失去非常多國際上的盟友與合作機會？",
        "a1": "退出聯合國",
        "a2": "啟動人類補完計劃",
        "a3": "建造大佛鋼彈",
        "a4": "製造T病毒",
        "undefined": 42
    },
    {
        "q": "2009年世界衛生組織（WHO）同意中華民國政府以世界衛生大會的什麼身分參加世界衛生大會？",
        "a1": "觀察員",
        "a2": "研究者",
        "a3": "練習生",
        "a4": "臨時工",
        "undefined": 45
    },
    {
        "q": "台灣1971年離開聯合國，喪失世界電信組織的會籍，被配發886的國碼，請問本來的國碼是？",
        "a1": 86,
        "a2": 666,
        "a3": 9487,
        "a4": 42,
        "undefined": 44
    },
    {
        "q": "請問舉辦2017年夏季世界大學運動會的城市是？",
        "a1": "台北",
        "a2": "倫敦",
        "a3": "巴黎",
        "a4": "米蘭",
        "undefined": 23
    },
    {
        "q": "請問舉辦2017年夏季世界大學運動會的國家是？",
        "a1": "台灣",
        "a2": "英國",
        "a3": "德國",
        "a4": "美國",
        "undefined": 23
    },
    {
        "q": "請問台灣參加2017年夏季世界大學運動會是以什麼名義？",
        "a1": "中華台北",
        "a2": "第三新臺北市",
        "a3": "可愛巧鬼島",
        "a4": "台灣",
        "undefined": 27
    },
    {
        "q": "2017年的世界大學運動會申辦國，除了台灣以外還有哪一個國家？",
        "a1": "巴西",
        "a2": "瑞典",
        "a3": "冰島",
        "a4": "挪威",
        "undefined": 31
    },
    {
        "q": "2017年5月，中國史上首次以意圖顛覆政權罪逮捕台灣人，此人為？",
        "a1": "李明哲",
        "a2": "李遠哲",
        "a3": "李明博",
        "a4": "李玖哲",
        "undefined": 32
    },
    {
        "q": "2016年，到北韓旅遊的美國人溫畢爾（Warmbier）為何被逮捕，並在獲釋一週後死亡？",
        "a1": "偷拿宣傳海報",
        "a2": "縱火",
        "a3": "傷害",
        "a4": "勒索",
        "undefined": 44
    },
    {
        "q": "得到101年度（2012年）運動菁英獎的謝淑薇，獲得體育署贈送的一百個什麼獎品，引起輿論？",
        "a1": "花瓶",
        "a2": "球衣",
        "a3": "球拍",
        "a4": "球鞋",
        "undefined": 45
    },
    {
        "q": "2015年12月發起的滅頂行動，最初是到哪一家連鎖量販店購買林鳳營鮮奶後退貨？",
        "a1": "好市多",
        "a2": "全家超商",
        "a3": "統一超商",
        "a4": "萊爾富",
        "undefined": 39
    },
    {
        "q": "2015年12月發起的滅頂行動，並沒有針對下列哪一家企業或品牌？",
        "a1": "義美",
        "a2": "味全",
        "a3": "林鳳營",
        "a4": "頂新",
        "undefined": 32
    },
    {
        "q": "俠醫林杰樑醫師於2013年8月過世，請問他的擅長領域是？",
        "a1": "毒物醫學",
        "a2": "心臟外科",
        "a3": "神經外科",
        "a4": "呼吸內科",
        "undefined": 28
    },
    {
        "q": "2015年，發生來自孟加拉與緬甸的哪一族群人在海上漂流，東南亞各國拒絕接納的難民危機？",
        "a1": "羅興亞人",
        "a2": "羅羅亞人",
        "a3": "羅馬人",
        "a4": "納美克星人",
        "undefined": 43
    },
    {
        "q": "2015年4月，五艘載有難民的偷渡船在地中海沉沒，各界開始用什麼來形容這樣往歐洲的移民潮。",
        "a1": "歐洲難民危機",
        "a2": "非酋的逆襲",
        "a3": "到歐洲吸歐氣",
        "a4": "給歐洲人加狀態",
        "undefined": 45
    },
    {
        "q": "2015年11月，法國哪裏發生一連串恐怖襲擊，調查發現犯人是2015年入歐的尋求庇護者。",
        "a1": "巴黎",
        "a2": "米蘭",
        "a3": "阿姆斯特丹",
        "a4": "馬德里",
        "undefined": 44
    },
    {
        "q": "2015年末，歐洲何國跨年夜發生大規模性侵犯和搶劫女性的事件，引起民眾質疑難民政策。",
        "a1": "德國",
        "a2": "美國",
        "a3": "加拿大",
        "a4": "中國",
        "undefined": 42
    },
    {
        "q": "於2010至2011年初，突尼西亞反政府示威導致政權倒台，此事件因其國花而得名，是指？",
        "a1": "茉莉花革命",
        "a2": "五月花革命",
        "a3": "魯冰花革命",
        "a4": "大腸花革命",
        "undefined": 43
    },
    {
        "q": "巴基斯坦的一位以爭取女性教育而聞名的活動家，2014年獲得諾貝爾和平獎，她的名字是？",
        "a1": "馬拉拉",
        "a2": "馬推推",
        "a3": "馬打打",
        "a4": "馬戳戳",
        "undefined": 42
    },
    {
        "q": "2010年獲得挪威諾貝爾和平獎以表彰他長期以非暴力方式在中國爭取基本人權的中國人是？",
        "a1": "劉曉波",
        "a2": "習近平",
        "a3": "溫家寶",
        "a4": "胡錦濤",
        "undefined": 42
    },
    {
        "q": "2017年6月，因確診肝癌晚期而獲准保外就醫，不久因病過世的中國籍諾貝爾獎得主是？",
        "a1": "劉曉波",
        "a2": "習近平",
        "a3": "溫家寶",
        "a4": "胡錦濤",
        "undefined": 41
    },
    {
        "q": "在2012年為表彰其為歐洲和平與和解，民主與人權上做出的貢獻，獲得諾貝爾和平獎的組織是？",
        "a1": "歐盟",
        "a2": "北約",
        "a3": "歐元區",
        "a4": "大英國協",
        "undefined": 44
    },
    {
        "q": "在2010年為表彰他在傳播人為氣候變化知識上做出的努力，獲得諾貝爾和平獎的前美國副總統是？",
        "a1": "艾爾·高爾",
        "a2": "李奧納多",
        "a3": "唐納·川普",
        "a4": "巴拉克·歐巴馬",
        "undefined": 45
    },
    {
        "q": "1979年的諾貝爾和平獎頒發給一位修女，她是？",
        "a1": "德蕾莎修女",
        "a2": "春日美空",
        "a3": "希耶爾",
        "a4": "約賽特",
        "undefined": 23
    },
    {
        "q": "2016年9月4日，一位修女被天主教會封聖成為被教會承認成為聖人，她是？",
        "a1": "德蕾莎修女",
        "a2": "莉絲·亞爾珍特",
        "a3": "茵蒂克絲",
        "a4": "羅塞特·克里斯特法",
        "undefined": 36
    },
    {
        "q": "為表彰他在解放西藏上鬥爭和對動用暴力的持續反對，於1989獲諾貝爾和平獎的西藏前領導人是？",
        "a1": "第十四世達賴喇嘛",
        "a2": "成吉思汗",
        "a3": "金輪法王",
        "a4": "班禪喇嘛",
        "undefined": 45
    },
    {
        "q": "表彰她為爭取民主和人權做出的非暴力抗爭，於1991年獲得諾貝爾和平獎的現任緬甸國務資政是？",
        "a1": "翁山蘇姬",
        "a2": "希拉蕊·柯林頓",
        "a3": "蔡英文",
        "a4": "朴槿惠",
        "undefined": 45
    },
    {
        "q": "2017年3月10日，南韓憲法法院宣布總統彈劾案成立，誰成為南韓史上第一位被彈劾的總統？",
        "a1": "朴槿惠",
        "a2": "文在寅",
        "a3": "李明博",
        "a4": "盧武鉉",
        "undefined": 44
    },
    {
        "q": "2016年韓國政治醜聞，是指韓國總統的親信利用與總統關係獲取利益，請問當時在位的總統是？",
        "a1": "朴槿惠",
        "a2": "文在寅",
        "a3": "李明博",
        "a4": "盧武鉉",
        "undefined": 44
    },
    {
        "q": "在2000年成功進行首次南北韓雙邊會談，並在同年榮獲諾貝爾和平獎的韓國前總統是？",
        "a1": "金大中",
        "a2": "朴槿惠",
        "a3": "文在寅",
        "a4": "李明博",
        "undefined": 40
    },
    {
        "q": "2013年發表電影《風起》後，曾宣布引退，但又在2016年透露復出消息的動畫大師是？",
        "a1": "宮崎駿",
        "a2": "攻擊駿",
        "a3": "宮崎英高",
        "a4": "宮崎葵",
        "undefined": 42
    },
    {
        "q": "2017年7月，伊拉克總理宣布哪一個伊拉克大城從伊斯蘭國統治下得到解放？",
        "a1": "摩蘇爾",
        "a2": "平壤",
        "a3": "柏林",
        "a4": "華沙",
        "undefined": 36
    },
    {
        "q": "2013年7月，哪位士官在退伍前死亡，且生前疑似遭欺凌、虐待而引發社會輿論關注？",
        "a1": "洪仲丘",
        "a2": "阿榮",
        "a3": "孫建國",
        "a4": "張火木",
        "undefined": 40
    },
    {
        "q": "2013年8月3日在凱道發起「萬人送仲丘」遊行，是自2006以來最大的公民運動，這是為了？",
        "a1": "洪仲丘事件",
        "a2": "服貿協議",
        "a3": "大埔事件",
        "a4": "美麗灣事件",
        "undefined": 45
    },
    {
        "q": "台灣在1990年3月，學生集結在中正紀念堂廣場上靜坐，提出四大訴求，被稱為什麼運動？",
        "a1": "野白合學運",
        "a2": "野薑花學運",
        "a3": "野玫瑰學運",
        "a4": "野台妹學運",
        "undefined": 42
    },
    {
        "q": "2012年在台灣的社運，以反對媒體壟斷、防止財團控制台灣媒體為主要訴求，指的是？",
        "a1": "反媒體壟斷運動",
        "a2": "太陽花運動",
        "a3": "去公園運動",
        "a4": "減肥得運動",
        "undefined": 40
    },
    {
        "q": "2014年3月18日至4月10日間，臺灣的大學生與公民團體佔領立法院的社會運動稱為？",
        "a1": "太陽花運動",
        "a2": "大腸花運動",
        "a3": "香蕉運動",
        "a4": "起司蛋糕運動",
        "undefined": 42
    },
    {
        "q": "2014年3月18日晚間開始，的台灣學生佔領立法院議事廳是為了抗議什麼？",
        "a1": "服貿協議黑箱運作",
        "a2": "抽不到SS卡",
        "a3": "立法院冷氣比較涼",
        "a4": "吃太飽",
        "undefined": 36
    },
    {
        "q": "2017年8月5日，為什麼中國的串流平台愛奇藝將台劇「他們在畢業的前一天爆炸2」下架。",
        "a1": "涉及社會運動",
        "a2": "違反善良風俗",
        "a3": "鼓吹資本主義",
        "a4": "批評領導人",
        "undefined": 43
    },
    {
        "q": "2011年，台灣發現部分供應商在常見的食品添加物「起雲劑」中，加了什麼？",
        "a1": "塑化劑",
        "a2": "自白劑",
        "a3": "清潔劑",
        "a4": "麻醉劑",
        "undefined": 36
    },
    {
        "q": "2013年，哪一家公司利用便宜的棉籽油混充食用油中降低成本還違法添加銅葉綠素？",
        "a1": "大統",
        "a2": "大桶",
        "a3": "大筒",
        "a4": "大曈",
        "undefined": 39
    },
    {
        "q": "2014年9月，爆發噁油案，哪一間公司使用將餿水油、回鍋油、飼料油混充的食用油生產食品？",
        "a1": "頂新集團味全公司",
        "a2": "鴻海",
        "a3": "台積電",
        "a4": "聯發科",
        "undefined": 44
    }
]

var bs = function(n){
    return '#mG61Hd > div > div.freebirdFormviewerViewFormContent > div.freebirdFormviewerViewItemList > div:nth-child('+ n +') > div.freebirdFormviewerViewItemsTextItemWrapper > div > div.quantumWizTextinputPaperinputMainContent.exportContent > div > div.quantumWizTextinputPaperinputInputArea > input'
}
var qs = function(n){
    return '#mG61Hd > div > div.freebirdFormviewerViewFormContent > div.freebirdFormviewerViewItemList > div:nth-child('+ n +') > div.quantumWizTextinputPapertextareaEl.modeLight.freebirdFormviewerViewItemsTextLongText.freebirdThemedInput > div.quantumWizTextinputPapertextareaMainContent.exportContent > div.quantumWizTextinputPapertextareaContentArea.exportContentArea > textarea'
}
var getSelector = function(type){
    if (type == 0){
        return {
            code: bs(1),
            mail: bs(2),
            addr: bs(3),
            phone: bs(4)
        }
    }else{
        return {
            q: qs(3),
            a1: qs(4),
            a2: qs(5),
            a3: qs(6),
            a4: qs(7),
        }
    }
}

var ins = function(index){
    var ss = getSelector(index);
    for (var key in q[index]){
        if (index == 0){
            $(ss[key]).value = q[index][key]
        }else{
            $(ss[key]).innerText = q[index][key]
        }
    }
}

ins()
